<?php

////////////////////////////////////////////////////////////////////////////////
///	@file			ReversiPoint.php
///	@brief			リバーシポイントクラス実装ファイル
///	@author			Yuta Yoshinaga
///	@date			2018.03.02
///	$Version:		$
///	$Revision:		$
///
/// Copyright (c) 2018 Yuta Yoshinaga. All Rights reserved.
///
/// - 本ソフトウェアの一部又は全てを無断で複写複製（コピー）することは、
///   著作権侵害にあたりますので、これを禁止します。
/// - 本製品の使用に起因する侵害または特許権その他権利の侵害に関しては
///   当社は一切その責任を負いません。
///
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
///	@class		ReversiPoint
///	@brief		リバーシポイント
///
////////////////////////////////////////////////////////////////////////////////
class ReversiPoint
{
	// #region メンバ変数
	private $_x;								//!< X
	private $_y;								//!< Y
	// #endregion

	// #region プロパティ
	public function getx(){ return $this->_x; }
	public function setx($_x){ $this->_x = $_x; }

	public function gety(){ return $this->_y; }
	public function sety($_y){ $this->_y = $_y; }
	// #endregion

	////////////////////////////////////////////////////////////////////////////////
	///	@brief			コンストラクタ
	///	@fn				__construct()
	///	@return			ありません
	///	@author			Yuta Yoshinaga
	///	@date			2018.03.02
	///
	////////////////////////////////////////////////////////////////////////////////
	public function __construct()
	{
		$this->_x = 0;
		$this->_y = 0;
	}

	////////////////////////////////////////////////////////////////////////////////
	///	@brief			デストラクタ
	///	@fn				__destruct()
	///	@return			ありません
	///	@author			Yuta Yoshinaga
	///	@date			2018.03.02
	///
	////////////////////////////////////////////////////////////////////////////////
	public function __destruct()
	{
	}
}

?>
